empRoot

<?xml version="1.0" encoding="UTF-8"?>
<soap:Envelope xmlns:soap="http://www.w3.org/2003/05/soap-envelope" xmlns:typ="http://sample.com/reservation/guest/types">
   <soap:Header/>
   <soap:Body>
      <typ:addEmployee>
         <!--Optional:-->
         <typ:name>testing</typ:name>
         <!--Optional:-->
         <typ:id>445</typ:id>
         <!--Optional:-->
         <typ:Department>soapp</typ:Department>
         <!--Optional:-->
         <typ:age>23</typ:age>
      </typ:addEmployee>
   </soap:Body>
</soap:Envelope>